Тест/Тест/src/Documents/ЗакупкаТовара/ЗакупкаТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗакупкаТовара</name>
  <basedOn>Document.ЗаявкаЗакупкаТовара</basedOn>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организация</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаявкаЗакупкаТовара</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортнаяКомпания</name>
    <type>
      <types>CatalogRef.ТранспротнаяКомпания</types>
    </type>
  </attributes>
  <attributes>
    <name>ТрекНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрибытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Т_Т</name>
    <type>
      <types>EnumRef.Да_Нет</types>
    </type>
  </attributes>
  <attributes>
    <name>Д_Т</name>
    <type>
      <types>EnumRef.Да_Нет</types>
    </type>
  </attributes>
  <attributes>
    <name>Т_Д</name>
    <type>
      <types>EnumRef.Да_Нет</types>
    </type>
  </attributes>
  <attributes>
    <name>Д_Д</name>
    <type>
      <types>EnumRef.Да_Нет</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НДСДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГородОтправления</name>
    <type>
      <types>CatalogRef.Город</types>
    </type>
  </attributes>
  <attributes>
    <name>ГородПрибытия</name>
    <type>
      <types>CatalogRef.Город</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗакупки</name>
    <type>
      <types>EnumRef.СтатусыЗаявкаЗакупкаТоваров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗакупленныйТовар</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПродажи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Прибыль</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>1</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусПоступления</name>
      <type>
        <types>EnumRef.СтатусЗакупкиТовара</types>
      </type>
    </attributes>
    <attributes>
      <name>НазначениеДетали</name>
      <type>
        <types>CatalogRef.ПроектыРазработки</types>
        <types>DocumentRef.ПродажаЗапчастей</types>
        <types>String</types>
        <types>DocumentRef.ЗаказКлиента</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБЕЗНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест/Тест/src/Enums/СтатусыЗаявкаЗакупкаТоваров/СтатусыЗаявкаЗакупкаТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаявкаЗакупкаТоваров</name>
  <enumValues>
    <name>Ожидание</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Отработанно</name>
  </enumValues>
  <enumValues>
    <name>Отклонено</name>
  </enumValues>
</mdclass:Enum>

Тест/Тест/src/Documents/ЗаявкаЗакупкаТовара/ЗаявкаЗакупкаТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаЗакупкаТовара</name>
  <basedOn>Document.ЗаказНаряд</basedOn>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказНаряд</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗаявки</name>
    <type>
      <types>EnumRef.СтатусыЗаявкаЗакупкаТоваров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗакупленныйТовар</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Производитель</name>
      <type>
        <types>CatalogRef.Производитель</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаВЗаказНаряде</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тест/Тест/src/Documents/ЗакупкаТовара/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТИПЗНЧ(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаЗакупкаТовара")  Тогда
		
		Основание =  ДанныеЗаполнения; 
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ЗаявкаЗакупкаТовараЗакупленныйТовар.Товар КАК Товар,
			|	ЗаявкаЗакупкаТовараЗакупленныйТовар.Количество КАК Количество
			|ИЗ
			|	Документ.ЗаявкаЗакупкаТовара.ЗакупленныйТовар КАК ЗаявкаЗакупкаТовараЗакупленныйТовар
			|ГДЕ
			|	ЗаявкаЗакупкаТовараЗакупленныйТовар.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Основание);
		ЗакупленныйТовар.Загрузить(Запрос.Выполнить().Выгрузить());
		
	КонецЕСли; 
	
КонецПроцедуры




Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ДокОбъект = Основание.ПолучитьОбъект(); 
	ДокОбъект.СтатусЗаявки = Перечисления.СтатусыЗаявкаЗакупкаТоваров.ВРаботе; 
	ДокОбъект.Записать();

КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ДокОбъект = Основание.ПолучитьОбъект(); 
	ДокОбъект.СтатусЗаявки = Перечисления.СтатусыЗаявкаЗакупкаТоваров.Ожидание; 
	ДокОбъект.Записать();
	
КонецПроцедуры
